In [103]:
import pandas as pd
from datetime import datetime, timedelta

In [104]:
# using pandas to read dataset from csv file
zulo_bank = pd.read_csv('zulo_bank_dataset.csv')
# displaying the first five 
zulo_bank.head()

,FullName,Email,Phone,TransactionType,Amount,TransactionDate,AccountType,Balance,OpeningDate,LoanAmount,LoanType,StartDate,EndDate,InterestRate
0,Carol Miller,yfisher@example.org,6088279027,withdrawal,102.15,2023-04-26,Savings,5652.16,2019-08-12,NaN,NaN,NaN,NaN,NaN
1,Geoffrey Banks,gonzalesgeorge@example.net,001-546-857-6518x5359,withdrawal,358.80,2020-06-13,Credit,2881.24,2019-05-06,32428.90,Mortgage,2021-06-24,2050-01-08 04:59:17.907588,2.12
2,Geoffrey Banks,gonzalesgeorge@example.net,001-546-857-6518x5359,withdrawal,358.80,2020-06-13,Credit,2881.24,2019-05-06,31406.77,Personal,2021-02-27,2038-10-12 04:59:17.907821,4.63
3,Geoffrey Banks,gonzalesgeorge@example.net,001-546-857-6518x5359,withdrawal,358.80,2020-06-13,Credit,2881.24,2019-05-06,27834.00,Personal,2019-12-05,2037-08-15 04:59:17.909497,2.15
4,Geoffrey Banks,gonzalesgeorge@example.net,001-546-857-6518x5359,withdrawal,358.80,2020-06-13,Credit,2881.24,2019-05-06,27873.08,Auto,2022-01-19,2037-06-03 04:59:17.913974,7.03

In [105]:
# check the data info
zulo_bank.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1554 entries, 0 to 1553
Data columns (total 14 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   FullName         1554 non-null   object
 1   Email            1554 non-null   object
 2   Phone            1554 non-null   object
 3   TransactionType  1554 non-null   object
 4   Amount           1554 non-null   float64
 5   TransactionDate  1554 non-null   object
 6   AccountType      1554 non-null   object
 7   Balance          1554 non-null   float64
 8   OpeningDate      1554 non-null   object
 9   LoanAmount       1278 non-null   float64
 10  LoanType         1278 non-null   object
 11  StartDate        1278 non-null   object
 12  EndDate          1278 non-null   object
 13  InterestRate     1278 non-null   float64
dtypes: float64(4), object(10)
memory usage: 170.1+ KB

In [106]:
# the data has 1554 rows, and some columns have NULL value. 
# Those missing values have to be filled up with the appropriate parameters

zulo_bank.fillna({
    'loanAmount': 0.0,
    'LoanType': 'unknown',
    'InterestRate': 0.0
}, inplace=True)

In [107]:
# verify the info again
# all missing have been filled as specified by the code
zulo_bank.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1554 entries, 0 to 1553
Data columns (total 14 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   FullName         1554 non-null   object
 1   Email            1554 non-null   object
 2   Phone            1554 non-null   object
 3   TransactionType  1554 non-null   object
 4   Amount           1554 non-null   float64
 5   TransactionDate  1554 non-null   object
 6   AccountType      1554 non-null   object
 7   Balance          1554 non-null   float64
 8   OpeningDate      1554 non-null   object
 9   LoanAmount       1278 non-null   float64
 10  LoanType         1554 non-null   object
 11  StartDate        1278 non-null   object
 12  EndDate          1278 non-null   object
 13  InterestRate     1554 non-null   float64
dtypes: float64(4), object(10)
memory usage: 170.1+ KB

### The provided data is denormalized 
##### The data will be converted to 1NF

In [108]:
# Convert to 1NF by atomizing the 'FullName' column
# This spllits the 'FullName' into 'first_name' and 'last_name'ArithmeticError
zulo_bank[['first_name', 'last_name']] = zulo_bank['FullName'].str.split(expand=True)

display(zulo_bank.head())

,FullName,Email,Phone,TransactionType,Amount,TransactionDate,AccountType,Balance,OpeningDate,LoanAmount,LoanType,StartDate,EndDate,InterestRate,first_name,last_name
0,Carol Miller,yfisher@example.org,6088279027,withdrawal,102.15,2023-04-26,Savings,5652.16,2019-08-12,NaN,unknown,NaN,NaN,0.00,Carol,Miller
1,Geoffrey Banks,gonzalesgeorge@example.net,001-546-857-6518x5359,withdrawal,358.80,2020-06-13,Credit,2881.24,2019-05-06,32428.90,Mortgage,2021-06-24,2050-01-08 04:59:17.907588,2.12,Geoffrey,Banks
2,Geoffrey Banks,gonzalesgeorge@example.net,001-546-857-6518x5359,withdrawal,358.80,2020-06-13,Credit,2881.24,2019-05-06,31406.77,Personal,2021-02-27,2038-10-12 04:59:17.907821,4.63,Geoffrey,Banks
3,Geoffrey Banks,gonzalesgeorge@example.net,001-546-857-6518x5359,withdrawal,358.80,2020-06-13,Credit,2881.24,2019-05-06,27834.00,Personal,2019-12-05,2037-08-15 04:59:17.909497,2.15,Geoffrey,Banks
4,Geoffrey Banks,gonzalesgeorge@example.net,001-546-857-6518x5359,withdrawal,358.80,2020-06-13,Credit,2881.24,2019-05-06,27873.08,Auto,2022-01-19,2037-06-03 04:59:17.913974,7.03,Geoffrey,Banks

### 1NF to 2NF is the next thing to do by seperating the columns into their respective tables and introduce primary keys

In [109]:
# slicing out the customer table

customer = zulo_bank[['first_name', 'last_name', 'Email', 'Phone']].copy().drop_duplicates().reset_index(drop=True)
customer['customer_id'] = range(1, len(customer) + 1)
customer = customer[['customer_id', 'first_name', 'last_name', 'Email', 'Phone']]

customer.head()

,customer_id,first_name,last_name,Email,Phone
0,1,Carol,Miller,yfisher@example.org,6088279027
1,2,Geoffrey,Banks,gonzalesgeorge@example.net,001-546-857-6518x5359
2,3,Eric,Phillips,mark13@example.com,(699)516-7638x82918
3,4,Paul,Noble,harrisonrachel@example.net,+1-586-758-3968x3144
4,5,Ryan,Alexander,loganjohn@example.org,900.377.1792x148

In [110]:
# slicing out the account table
account = zulo_bank[['AccountType', 'Balance', 'OpeningDate']].copy().drop_duplicates().reset_index(drop=True)
account['account_id'] = range(1, len(account) + 1)
account = account[['account_id', 'AccountType', 'Balance', 'OpeningDate']]

account

     account_id AccountType  Balance OpeningDate
0             1     Savings  5652.16  2019-08-12
1             2      Credit  2881.24  2019-05-06
2             3     Savings  2391.90  2020-09-17
3             4      Credit  7880.53  2023-08-14
4             5      Credit  3020.69  2019-08-13
..          ...         ...      ...         ...
193         194      Credit  7251.00  2022-11-18
194         195    Checking  7140.83  2019-09-23
195         196    Checking  1782.43  2020-12-24
196         197      Credit  6893.38  2021-04-22
197         198     Savings  4040.05  2023-08-24

[198 rows x 4 columns]

In [111]:
# slicing the transaction table
transaction = zulo_bank[['TransactionType', 'Amount', 'TransactionDate']].copy().drop_duplicates().reset_index(drop=True)
transaction['transaction_id'] = range(1, len(transaction) + 1)
transaction = transaction[['transaction_id', 'TransactionType', 'Amount', 'TransactionDate']]

transaction

     transaction_id TransactionType  Amount TransactionDate
0                 1      withdrawal  102.15      2023-04-26
1                 2      withdrawal  358.80      2020-06-13
2                 3         deposit  112.41      2019-05-17
3                 4         deposit  463.13      2020-09-02
4                 5      withdrawal   21.94      2022-07-03
..              ...             ...     ...             ...
995             996      withdrawal  303.30      2023-07-09
996             997         deposit  484.00      2020-12-27
997             998      withdrawal  427.36      2023-06-19
998             999      withdrawal  415.01      2022-02-09
999            1000         deposit  115.48      2021-10-16

[1000 rows x 4 columns]

In [112]:
# slicing the loan table
loan = zulo_bank[['LoanAmount', 'LoanType',	'StartDate', 'EndDate', 'InterestRate']].copy().drop_duplicates().reset_index(drop=True)
loan['loan_id'] = range(1, len(loan) + 1)
loan = loan[['loan_id', 'LoanAmount', 'LoanType',	'StartDate', 'EndDate', 'InterestRate']]

loan

,loan_id,LoanAmount,LoanType,StartDate,EndDate,InterestRate
0,1,NaN,unknown,NaN,NaN,0.00
1,2,32428.90,Mortgage,2021-06-24,2050-01-08 04:59:17.907588,2.12
2,3,31406.77,Personal,2021-02-27,2038-10-12 04:59:17.907821,4.63
3,4,27834.00,Personal,2019-12-05,2037-08-15 04:59:17.909497,2.15
4,5,27873.08,Auto,2022-01-19,2037-06-03 04:59:17.913974,7.03
...,...,...,...,...,...,...
125,126,44785.92,Personal,2020-06-25,2050-08-25 04:59:17.912929,1.55
126,127,6815.56,Personal,2023-02-19,2033-12-16 04:59:17.907530,2.90
127,128,15095.53,Auto,2021-10-26,2053-12-08 04:59:17.908990,4.58
128,129,46561.79,Mortgage,2019-10-21,2033-08-13 04:59:17.913469,2.50
129,130,33481.52,Personal,2023-07-14,2048-08-02 04:59:17.914125,5.06

In [113]:
# Merge operations to create the zulo Bank

zulo_bank = zulo_bank.merge(customer, on=['first_name', 'last_name', 'Email', 'Phone'], how='left')\
                     .merge(account, on=['AccountType', 'Balance', 'OpeningDate'], how='left')\
                     .merge(transaction, on=['TransactionType', 'Amount', 'TransactionDate'], how='left')\
                     .merge(loan, on=['LoanAmount', 'LoanType',	'StartDate', 'EndDate', 'InterestRate'], how='left')\
                     [['customer_id', 'account_id', 'transaction_id', 'loan_id']]

In [114]:
zulo_bank

      customer_id  account_id  transaction_id  loan_id
0               1           1               1        1
1               2           2               2        2
2               2           2               2        3
3               2           2               2        4
4               2           2               2        5
...           ...         ...             ...      ...
1549           20         165             997       29
1550           20         165             997       30
1551           25          94             998        1
1552            5          68             999       11
1553            6          76            1000       12

[1554 rows x 4 columns]

In [115]:
zulo_bank.columns

Index(['customer_id', 'account_id', 'transaction_id', 'loan_id'], dtype='object')

In [116]:
## 2NF to 3NF 
#### This is achieved by creating date_dimension table 
# Define the start dates and end dates

start_date = datetime(2020, 1, 1)
current_date = datetime(2090, 12, 31)

# calculate the number of days between start_date and current_date
num_days = (current_date - start_date).days

#Generate a list of dates from start date to current date
date_list = [start_date + timedelta(days=x) for x in range(num_days +1)]

# Ensure date_id matches the length of the date list
date = {'date_id': [x for x in range(1, len(date_list) +1)], 'date': date_list}

#create dataFrame
date_dim = pd.DataFrame(date)

date_dim['Year'] = date_dim['date'].dt.year
date_dim['Month'] = date_dim['date'].dt.month
date_dim['Day'] = date_dim['date'].dt.day

In [117]:
date_dim

       date_id       date  Year  Month  Day
0            1 2020-01-01  2020      1    1
1            2 2020-01-02  2020      1    2
2            3 2020-01-03  2020      1    3
3            4 2020-01-04  2020      1    4
4            5 2020-01-05  2020      1    5
...        ...        ...   ...    ...  ...
25928    25929 2090-12-27  2090     12   27
25929    25930 2090-12-28  2090     12   28
25930    25931 2090-12-29  2090     12   29
25931    25932 2090-12-30  2090     12   30
25932    25933 2090-12-31  2090     12   31

[25933 rows x 5 columns]

In [118]:

# Ensure OpeningDate in 'account' and 'date' in 'date_dim' are of the same type
account['OpeningDate'] = pd.to_datetime(account['OpeningDate'])  # Convert to datetime
date_dim['date'] = pd.to_datetime(date_dim['date'])  # Convert to datetime

# Now merge on 'OpeningDate' and 'date'
account = account.merge(date_dim, left_on='OpeningDate', right_on='date', how='inner')\
                 .rename(columns={'date_id': 'OpeningDate_ID'})\
                 .reset_index(drop=True)\
                 [['account_id', 'AccountType', 'Balance', 'OpeningDate_ID']]

In [119]:
account

     account_id AccountType  Balance  OpeningDate_ID
0             3     Savings  2391.90             261
1             4      Credit  7880.53            1322
2             6     Savings   947.43             857
3             7     Savings  4492.62             244
4           173    Checking  5688.51             244
..          ...         ...      ...             ...
153         193      Credit  6047.23             580
154         194      Credit  7251.00            1053
155         196    Checking  1782.43             359
156         197      Credit  6893.38             478
157         198     Savings  4040.05            1332

[158 rows x 4 columns]

In [120]:
# Transaction table to 3NF

# Convert 'TransactionDate' to datetime format
transaction['TransactionDate'] = pd.to_datetime(transaction['TransactionDate'])  # Ensure it's in datetime64[ns]

# Merge with the date dimension, ensuring both sides are in datetime format
transaction = transaction.merge(date_dim, left_on='TransactionDate', right_on='date', how='inner')\
                                .rename(columns={'date_id': 'TransactionDate_ID'})\
                                .reset_index(drop=True)\
                                [['transaction_id', 'TransactionType', 'Amount', 'TransactionDate_ID']]

In [121]:
transaction

     transaction_id TransactionType  Amount  TransactionDate_ID
0                 1      withdrawal  102.15                1212
1               976      withdrawal  438.42                1212
2                 2      withdrawal  358.80                 165
3                 4         deposit  463.13                 246
4                 5      withdrawal   21.94                 915
..              ...             ...     ...                 ...
805             996      withdrawal  303.30                1286
806             997         deposit  484.00                 362
807             998      withdrawal  427.36                1266
808             999      withdrawal  415.01                 771
809            1000         deposit  115.48                 655

[810 rows x 4 columns]

In [122]:
# Convert 'StartDate' and 'EndDate' to datetime
loan['StartDate'] = pd.to_datetime(loan['StartDate'])  # Full datetime
loan['EndDate'] = pd.to_datetime(loan['EndDate'])  # Full datetime

# Merge with date dimension, ensuring both sides are in datetime format
loan = loan.merge(date_dim, left_on='StartDate', right_on='date', how='inner')\
           .rename(columns={'date_id': 'StartDate_ID'})  # Rename to StartDate_ID

# Merge for 'EndDate' with appropriate suffix to avoid duplicate column names
loan = loan.merge(date_dim, left_on='EndDate', right_on='date', how='inner', suffixes=('', '_end'))\
           .rename(columns={'date_id': 'EndDate_ID'})  # Rename to EndDate_ID

# Select desired columns and reset index
loan = loan.reset_index(drop=True)\
                 [['loan_id', 'LoanAmount', 'LoanType', 'StartDate_ID', 'EndDate_ID', 'InterestRate']]

In [123]:
loan

Empty DataFrame
Columns: [loan_id, LoanAmount, LoanType, StartDate_ID, EndDate_ID, InterestRate]
Index: []